{" ": 1, "!": 2, "\"": 3, "#": 4, "%": 5, "&": 6, "'": 7, "(": 8, ")": 9, "+": 10, ",": 11, "-": 12, ".": 13, "/": 14, "0": 15, "1": 16, "2": 17, "3": 18, "4": 19, "5": 20, "6": 21, "7": 22, "8": 23, "9": 24, ":": 25, ";": 26, "<": 27, ">": 28, "?": 29, "[": 30, "]": 31, "_": 32, "a": 33, "b": 34, "c": 35, "d": 36, "e": 37, "f": 38, "g": 39, "h": 40, "i": 41, "j": 42, "k": 43, "l": 44, "m": 45, "n": 46, "o": 47, "p": 48, "q": 49, "r": 50, "s": 51, "t": 52, "u": 53, "v": 54, "w": 55, "x": 56, "y": 57, "z": 58, "{": 59, "}": 60, "~": 61, "\u00e0": 62, "\u00e1": 63, "\u00e2": 64, "\u00e3": 65, "\u00e4": 66, "\u00e5": 67, "\u00e6": 68, "\u00e7": 69, "\u00e8": 70, "\u00e9": 71, "\u00ea": 72, "\u00eb": 73, "\u00ed": 74, "\u00ee": 75, "\u00ef": 76, "\u00f0": 77, "\u00f1": 78, "\u00f2": 79, "\u00f3": 80, "\u00f4": 81, "\u00f5": 82, "\u00f6": 83, "\u00f8": 84, "\u00f9": 85, "\u00fa": 86, "\u00fb": 87, "\u00fc": 88, "\u00fd": 89, "\u0101": 90, "\u0103": 91, "\u0105": 92, "\u010d": 93, "\u0113": 94, "\u0119": 95, "\u011b": 96, "\u011f": 97, "\u0129": 98, "\u012b": 99, "\u012d": 100, "\u0131": 101, "\u0142": 102, "\u0144": 103, "\u0148": 104, "\u014b": 105, "\u014d": 106, "\u014f": 107, "\u0151": 108, "\u0153": 109, "\u0159": 110, "\u015b": 111, "\u0161": 112, "\u016b": 113, "\u016d": 114, "\u0173": 115, "\u017e": 116, "\u01c0": 117, "\u01c1": 118, "\u01c2": 119, "\u01c3": 120, "\u0219": 121, "\u021b": 122, "\u0250": 123, "\u0251": 124, "\u0252": 125, "\u0253": 126, "\u0254": 127, "\u0255": 128, "\u0256": 129, "\u0258": 130, "\u0259": 131, "\u025a": 132, "\u025b": 133, "\u025c": 134, "\u025d": 135, "\u025e": 136, "\u0261": 137, "\u0264": 138, "\u0265": 139, "\u0266": 140, "\u0268": 141, "\u026a": 142, "\u026b": 143, "\u026c": 144, "\u026d": 145, "\u026f": 146, "\u0271": 147, "\u0272": 148, "\u0273": 149, "\u0275": 150, "\u0276": 151, "\u0278": 152, "\u0279": 153, "\u027b": 154, "\u027d": 155, "\u027e": 156, "\u0281": 157, "\u0283": 158, "\u0288": 159, "\u0289": 160, "\u028a": 161, "\u028b": 162, "\u028c": 163, "\u028d": 164, "\u028e": 165, "\u028f": 166, "\u0292": 167, "\u0294": 168, "\u0295": 169, "\u0298": 170, "\u0299": 171, "\u029f": 172, "\u02b0": 173, "\u02b1": 174, "\u02b2": 175, "\u02b7": 176, "\u02bb": 177, "\u02bc": 178, "\u02c0": 179, "\u02c8": 180, "\u02cc": 181, "\u02d0": 182, "\u02d1": 183, "\u02d4": 184, "\u02de": 185, "\u02e0": 186, "\u02e1": 187, "\u02e4": 188, "\u02e5": 189, "\u02e6": 190, "\u02e7": 191, "\u02e8": 192, "\u02e9": 193, "\u0302": 194, "\u0303": 195, "\u0306": 196, "\u0308": 197, "\u030a": 198, "\u030d": 199, "\u0319": 200, "\u031a": 201, "\u031d": 202, "\u031e": 203, "\u031f": 204, "\u0320": 205, "\u0325": 206, "\u0329": 207, "\u032a": 208, "\u032c": 209, "\u032f": 210, "\u0330": 211, "\u0334": 212, "\u033d": 213, "\u0346": 214, "\u035c": 215, "\u0361": 216, "\u03b2": 217, "\u03b8": 218, "\u03c7": 219, "\u1d48": 220, "\u1d4a": 221, "\u1e5b": 222, "\u1e6d": 223, "\u1ebd": 224, "\u207f": 225, "\u2193": 226, "\u2640": 227, "\u2642": 228, "[PAD]": 0}