{"format": "graph-model", "generatedBy": "2.20.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"enc_in": {"name": "enc_in:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "40"}]}}, "dec_in": {"name": "dec_in:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "39"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "39"}, {"size": "229"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/ones_like/Const", "op": "Const", "attr": {"dtype": {"type": "DT_BOOL"}, "value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/ExpandDims", "op": "Const", "attr": {"dtype": {"type": "DT_BOOL"}, "value": {"tensor": {"dtype": "DT_BOOL", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "39"}, {"size": "39"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/query_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/query_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/query_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/key_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/key_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/key_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/Cast/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_2_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "229"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_2_1/Less/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_2_1/strided_slice", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_2_1/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "unknown_14", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "39"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/value_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/value_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/value_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/attention_output_1/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/attention_output_1/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/attention_output_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_2_1/moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_2_1/moments/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_2_1/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_2_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_2_1/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_2_1/query_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_2_1/query_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_2_1/query_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_2_1/key_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_2_1/key_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_2_1/key_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_2_1/Cast/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/query_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/query_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/query_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/key_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/key_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/key_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/Cast/x", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "229"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/Less/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/strided_slice", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "unknown_0", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "40"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/value_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/value_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/value_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/attention_output_1/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/attention_output_1/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/attention_output_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1/moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1/moments/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1_2/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1_2/moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1_2/moments/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1_2/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1_2/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1_2/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_2_1/value_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "512"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_2_1/value_1/Reshape_1/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_2_1/value_1/Add/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_2_1/attention_output_1/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_2_1/attention_output_1/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "512"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_2_1/attention_output_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_3_1/moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_3_1/moments/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_3_1/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_3_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_3_1/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/dense_2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/dense_2_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/dense_3_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/dense_3_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_4_1/moments/mean/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_4_1/moments/variance/reduction_indices", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_4_1/add/y", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_4_1/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_4_1/Reshape_1", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/dense_4_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "229"}]}}}}}, {"name": "StatefulPartitionedCall/functional_1/dense_4_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "229"}]}}}}}, {"name": "dec_in", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "39"}]}}}}, {"name": "enc_in", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "40"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_2_1/Cast", "op": "Cast", "input": ["dec_in"], "attr": {"DstT": {"type": "DT_INT32"}, "SrcT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/Cast", "op": "Cast", "input": ["enc_in"], "attr": {"DstT": {"type": "DT_INT32"}, "SrcT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_2_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/functional_1/embedding_2_1/Cast", "StatefulPartitionedCall/functional_1/embedding_2_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_2_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/embedding_2_1/Cast", "StatefulPartitionedCall/functional_1/embedding_2_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/functional_1/embedding_1/Cast", "StatefulPartitionedCall/functional_1/embedding_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/embedding_1/Cast", "StatefulPartitionedCall/functional_1/embedding_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_2_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/functional_1/embedding_2_1/Less", "StatefulPartitionedCall/functional_1/embedding_2_1/add", "StatefulPartitionedCall/functional_1/embedding_2_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/functional_1/embedding_1/Less", "StatefulPartitionedCall/functional_1/embedding_1/add", "StatefulPartitionedCall/functional_1/embedding_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_2_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_1/embedding_2_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/functional_1/embedding_2_1/SelectV2", "StatefulPartitionedCall/functional_1/embedding_2_1/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/embedding_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/functional_1/embedding_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/functional_1/embedding_1/SelectV2", "StatefulPartitionedCall/functional_1/embedding_1/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_1/Add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/embedding_2_1/GatherV2", "unknown_14"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/embedding_1/GatherV2", "unknown_0"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/query_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_1/Add_2", "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/query_1/Reshape"], "attr": {"grad_x": {"b": false}, "adj_x": {"b": false}, "adj_y": {"b": false}, "grad_y": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/key_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_1/Add_2", "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/key_1/Reshape"], "attr": {"grad_x": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_y": {"b": false}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/value_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_1/Add_2", "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/value_1/Reshape"], "attr": {"grad_x": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_y": {"b": false}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/query_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_1/Add", "StatefulPartitionedCall/functional_1/multi_head_attention_1/query_1/Reshape"], "attr": {"grad_x": {"b": false}, "adj_x": {"b": false}, "adj_y": {"b": false}, "grad_y": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/key_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_1/Add", "StatefulPartitionedCall/functional_1/multi_head_attention_1/key_1/Reshape"], "attr": {"grad_x": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_y": {"b": false}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/value_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_1/Add", "StatefulPartitionedCall/functional_1/multi_head_attention_1/value_1/Reshape"], "attr": {"grad_x": {"b": false}, "adj_x": {"b": false}, "adj_y": {"b": false}, "grad_y": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/query_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1_2/query_1/MatMul", "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/query_1/Reshape_1/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/key_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1_2/key_1/MatMul", "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/key_1/Reshape_1/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/value_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1_2/value_1/MatMul", "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/value_1/Reshape_1/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/query_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1/query_1/MatMul", "StatefulPartitionedCall/functional_1/multi_head_attention_1/query_1/Reshape_1/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/key_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1/key_1/MatMul", "StatefulPartitionedCall/functional_1/multi_head_attention_1/key_1/Reshape_1/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/value_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1/value_1/MatMul", "StatefulPartitionedCall/functional_1/multi_head_attention_1/value_1/Reshape_1/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/query_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1_2/query_1/Reshape_1", "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/query_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/key_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1_2/key_1/Reshape_1", "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/key_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/value_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1_2/value_1/Reshape_1", "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/value_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/query_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1/query_1/Reshape_1", "StatefulPartitionedCall/functional_1/multi_head_attention_1/query_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/key_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1/key_1/Reshape_1", "StatefulPartitionedCall/functional_1/multi_head_attention_1/key_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/value_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1/value_1/Reshape_1", "StatefulPartitionedCall/functional_1/multi_head_attention_1/value_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1_2/query_1/Add", "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/key_1/Add"], "attr": {"equation": {"s": "QlROSCxCU05ILT5CTlRT"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1/query_1/Add", "StatefulPartitionedCall/functional_1/multi_head_attention_1/key_1/Add"], "attr": {"equation": {"s": "QlROSCxCU05ILT5CTlRT"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1_2/einsum/Einsum", "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/Cast/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1/einsum/Einsum", "StatefulPartitionedCall/functional_1/multi_head_attention_1/Cast/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/ones_like/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1_2/Mul"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/ones_like", "op": "Fill", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1_2/ones_like/Shape", "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/ones_like/Const"], "attr": {"T": {"type": "DT_BOOL"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/einsum_1/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1/Softmax", "StatefulPartitionedCall/functional_1/multi_head_attention_1/value_1/Add"], "attr": {"equation": {"s": "Qk5UUyxCU05ILT5CVE5I"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/LogicalAnd", "op": "LogicalAnd", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1_2/ones_like", "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/ExpandDims"]}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/attention_output_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1/einsum_1/Einsum", "StatefulPartitionedCall/functional_1/multi_head_attention_1/attention_output_1/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1_2/LogicalAnd", "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/Mul", "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/Const"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/attention_output_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1/attention_output_1/Reshape", "StatefulPartitionedCall/functional_1/multi_head_attention_1/attention_output_1/Reshape_1"], "attr": {"grad_x": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_y": {"b": false}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1_2/SelectV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1/attention_output_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1/attention_output_1/MatMul", "StatefulPartitionedCall/functional_1/multi_head_attention_1/attention_output_1/BiasAdd/ReadVariableOp"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-11"}, {"size": "40"}, {"size": "128"}]}, {"dim": [{"size": "128"}]}]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/einsum_1/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1_2/Softmax", "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/value_1/Add"], "attr": {"equation": {"s": "Qk5UUyxCU05ILT5CVE5I"}, "T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/functional_1/Add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/Add", "StatefulPartitionedCall/functional_1/multi_head_attention_1/attention_output_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/attention_output_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1_2/einsum_1/Einsum", "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/attention_output_1/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/functional_1/Add_1", "StatefulPartitionedCall/functional_1/layer_normalization_1/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/attention_output_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1_2/attention_output_1/Reshape", "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/attention_output_1/Reshape_1"], "attr": {"grad_x": {"b": false}, "adj_x": {"b": false}, "adj_y": {"b": false}, "grad_y": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/functional_1/layer_normalization_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/functional_1/Add_1", "StatefulPartitionedCall/functional_1/layer_normalization_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/attention_output_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_1_2/attention_output_1/MatMul", "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/attention_output_1/BiasAdd/ReadVariableOp"], "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-4"}, {"size": "39"}, {"size": "128"}]}, {"dim": [{"size": "128"}]}]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/functional_1/layer_normalization_1/moments/SquaredDifference", "StatefulPartitionedCall/functional_1/layer_normalization_1/moments/variance/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/Add_4", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/Add_2", "StatefulPartitionedCall/functional_1/multi_head_attention_1_2/attention_output_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/layer_normalization_1/moments/variance", "StatefulPartitionedCall/functional_1/layer_normalization_1/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_2_1/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/functional_1/Add_4", "StatefulPartitionedCall/functional_1/layer_normalization_2_1/moments/mean/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/functional_1/layer_normalization_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_2_1/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/functional_1/layer_normalization_2_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_2_1/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/functional_1/Add_4", "StatefulPartitionedCall/functional_1/layer_normalization_2_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/layer_normalization_1/Rsqrt", "StatefulPartitionedCall/functional_1/layer_normalization_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_2_1/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/functional_1/layer_normalization_2_1/moments/SquaredDifference", "StatefulPartitionedCall/functional_1/layer_normalization_2_1/moments/variance/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/layer_normalization_1/Neg", "StatefulPartitionedCall/functional_1/layer_normalization_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/Add_1", "StatefulPartitionedCall/functional_1/layer_normalization_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_2_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/layer_normalization_2_1/moments/variance", "StatefulPartitionedCall/functional_1/layer_normalization_2_1/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/layer_normalization_1/mul_1", "StatefulPartitionedCall/functional_1/layer_normalization_1/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_2_1/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/functional_1/layer_normalization_2_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/layer_normalization_1/mul_2", "StatefulPartitionedCall/functional_1/layer_normalization_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_2_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/layer_normalization_2_1/Rsqrt", "StatefulPartitionedCall/functional_1/layer_normalization_2_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_1/layer_normalization_1/add_2", "StatefulPartitionedCall/functional_1/dense_1/Cast/ReadVariableOp"], "attr": {"grad_x": {"b": false}, "adj_x": {"b": false}, "adj_y": {"b": false}, "grad_y": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_2_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/layer_normalization_2_1/Neg", "StatefulPartitionedCall/functional_1/layer_normalization_2_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_2_1/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/Add_4", "StatefulPartitionedCall/functional_1/layer_normalization_2_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_1/dense_1/MatMul", "StatefulPartitionedCall/functional_1/dense_1/BiasAdd/ReadVariableOp"], "attr": {"_input_shapes": {"list": {"shape": [{"unknownRank": true}, {"dim": [{"size": "128"}]}]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_2_1/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/layer_normalization_2_1/mul_1", "StatefulPartitionedCall/functional_1/layer_normalization_2_1/Reshape_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_1/dense_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_2_1/add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/layer_normalization_2_1/mul_2", "StatefulPartitionedCall/functional_1/layer_normalization_2_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1_2/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_1/dense_1/Relu", "StatefulPartitionedCall/functional_1/dense_1_2/Cast/ReadVariableOp"], "attr": {"grad_x": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_y": {"b": false}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_2_1/query_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_1/layer_normalization_2_1/add_2", "StatefulPartitionedCall/functional_1/multi_head_attention_2_1/query_1/Reshape"], "attr": {"grad_x": {"b": false}, "adj_x": {"b": false}, "adj_y": {"b": false}, "grad_y": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_1/dense_1_2/MatMul", "StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd/ReadVariableOp"], "attr": {"_input_shapes": {"list": {"shape": [{"unknownRank": true}, {"dim": [{"size": "128"}]}]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_2_1/query_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_2_1/query_1/MatMul", "StatefulPartitionedCall/functional_1/multi_head_attention_2_1/query_1/Reshape_1/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/Add_3", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/layer_normalization_1/add_2", "StatefulPartitionedCall/functional_1/dense_1_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/multi_head_attention_2_1/query_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/multi_head_attention_2_1/query_1/Reshape_1", "StatefulPartitionedCall/functional_1/multi_head_attention_2_1/query_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1_2/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/functional_1/Add_3", "StatefulPartitionedCall/functional_1/layer_normalization_1_2/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1_2/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/functional_1/layer_normalization_1_2/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1_2/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/functional_1/Add_3", "StatefulPartitionedCall/functional_1/layer_normalization_1_2/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1_2/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/functional_1/layer_normalization_1_2/moments/SquaredDifference", "StatefulPartitionedCall/functional_1/layer_normalization_1_2/moments/variance/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1_2/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_1/layer_normalization_1_2/moments/variance", "StatefulPartitionedCall/functional_1/layer_normalization_1_2/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1_2/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/functional_1/layer_normalization_1_2/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1_2/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/layer_normalization_1_2/Rsqrt", "StatefulPartitionedCall/functional_1/layer_normalization_1_2/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1_2/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/layer_normalization_1_2/Neg", "StatefulPartitionedCall/functional_1/layer_normalization_1_2/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_1/layer_normalization_1_2/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/functional_1/Add_3", "StatefulPartitionedCall/functional_1/layer_normalization_1_2/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": 