{"format": "layers-model", "generatedBy": "keras v3.12.1", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.12.1", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 40], "dtype": "float32", "sparse": false, "ragged": false, "name": "enc_in"}, "name": "enc_in", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "input_dim": 229, "output_dim": 128, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"seed": null, "minval": -0.05, "maxval": 0.05}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true}, "name": "embedding", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40], "dtype": "float32", "keras_history": ["enc_in", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Add", "config": {"name": "add"}, "name": "add", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 40, 128], "dtype": "float32", "keras_history": ["embedding", 0, 0]}}, {"class_name": "__tensor__", "config": {"value": [[[-0.03600536659359932, 0.030765239149332047, -0.028840279206633568, -0.009718049317598343, -0.013315487653017044, 0.0035368800163269043, -0.037820376455783844, 0.002469576895236969, 0.018277380615472794, -0.04365910217165947, -0.003555167466402054, -0.02278752438724041, -0.02915095165371895, -0.041448283940553665, 0.03774331882596016, -0.0025034770369529724, 0.04204912111163139, -0.0020220279693603516, -0.013734675943851471, 0.031782422214746475, -0.020262837409973145, 0.011322759091854095, -0.026449894532561302, 0.03756028786301613, 0.016762379556894302, -0.028949011117219925, -0.012443315237760544, -0.024899113923311234, -0.010017134249210358, 0.0009491927921772003, 0.026791397482156754, 0.009709596633911133, 0.023544732481241226, -0.020551228895783424, 0.0031742341816425323, -0.046518899500370026, -0.03639575093984604, 0.04897430166602135, -0.02950521744787693, -0.03601791709661484, 0.010628439486026764, 0.022388245910406113, -0.01589379459619522, -0.019457554444670677, -0.017333388328552246, -0.013490594923496246, -0.010606609284877777, 0.04233831539750099, 0.045149240642786026, -0.007958270609378815, 0.03693424537777901, -0.003825843334197998, 0.004402518272399902, 0.00018449872732162476, -0.01465597003698349, -0.0006284117698669434, 0.014376450330018997, 0.028354991227388382, -0.0023566000163555145, -0.01901874504983425, 0.015700671821832657, -0.030568957328796387, -0.03957656770944595, 0.009552013128995895, -0.001435898244380951, -0.0025118961930274963, -0.03584406524896622, 0.008038483560085297, -0.001046299934387207, -0.028140723705291748, -0.035135410726070404, -0.01653139665722847, -0.010231874883174896, 0.002698756754398346, 0.015221882611513138, 0.0032005533576011658, 0.02268126979470253, -0.014142323285341263, 0.03566182777285576, 0.03783510997891426, 0.04238556697964668, 0.027891959995031357, -0.024256838485598564, 0.022794637829065323, 0.0227883942425251, 0.002162586897611618, 0.018497731536626816, 0.0012363307178020477, 0.02949061617255211, 0.03456881269812584, -0.007002510130405426, -0.0021249055862426758, 0.03953845426440239, 0.0009371154010295868, 0.029990974813699722, -0.019933093339204788, 0.03841607645153999, -0.0495646595954895, -0.029528213664889336, -0.040535639971494675, 0.03543151542544365, -0.015569627285003662, 0.023329924792051315, 0.04914829507470131, 0.011262394487857819, -0.0037063732743263245, -0.03326423466205597, -0.038703642785549164, -0.04147304221987724, -0.02453521452844143, 0.01754545047879219, 0.0010121092200279236, -0.0061093345284461975, -0.029598666355013847, 0.005555234849452972, -0.03327566385269165, -0.04888968542218208, 0.019573260098695755, -0.041535090655088425, 0.01528923586010933, -0.0236989613622427, -0.020644713193178177, 0.003806494176387787, 0.015993524342775345, -0.029876649379730225, -0.0168396458029747, 0.0423133485019207, 0.032386664301157], [0.04292202368378639, -0.029016435146331787, 0.02551337704062462, 0.008437953889369965, -0.02973015420138836, 0.04819783940911293, -0.02621786668896675, 0.04493254795670509, 0.016489122062921524, -0.014242123812437057, 0.01675652340054512, 0.011208690702915192, 0.0055634863674640656, 0.003983296453952789, -0.015117190778255463, 0.047140706330537796, 0.013557199388742447, -0.01721637323498726, -0.01102358102798462, 0.023749876767396927, 0.03448188677430153, 0.04501355066895485, -0.01490170881152153, 0.008412469178438187, 0.0181417353451252, -0.007689021527767181, 0.011535096913576126, -0.015376769006252289, 0.035531867295503616, 0.009092546999454498, -0.030325686559081078, 0.020501863211393356, 0.026491347700357437, -0.0036151520907878876, -0.021316779777407646, -0.03197493404150009, -0.0015333518385887146, 0.021060992032289505, -0.028831375762820244, 0.018169287592172623, 0.019305873662233353, -0.0013279542326927185, -0.008268095552921295, 0.021416012197732925, 0.014407981187105179, -0.00952751561999321, -0.031180357560515404, 0.003953348845243454, 0.0203782357275486, 0.029582832008600235, 0.010143041610717773, 0.0474490262567997, -0.02836688794195652, -0.014596093446016312, 0.00600438192486763, -0.023067926988005638, -0.04084266349673271, 0.009317971765995026, 0.03133164718747139, -0.03017294406890869, -0.0497470386326313, -0.029059721156954765, 0.019229557365179062, 0.032528553158044815, 0.020559359341859818, -0.0110868439078331, 0.02793082967400551, 0.023435521870851517, -0.028207123279571533, 0.04491980001330376, 0.037097636610269547, 0.04995666816830635, -0.036061905324459076, -0.008146382868289948, 0.011742759495973587, 0.032998595386743546, -0.022173596546053886, 0.029134344309568405, -0.020517755299806595, -0.02840583398938179, 0.045844290405511856, 0.0091903917491436, 0.017490092664957047, 0.01815059408545494, -0.03614913299679756, -0.0476674810051918, -0.003645278513431549, -0.03703795745968819, 0.007317580282688141, 0.03802638128399849, -0.017187129706144333, 0.0300285704433918, 0.04348459467291832, 0.016552891582250595, -0.03183896839618683, 0.025226358324289322, 0.0014063939452171326, 0.007060181349515915, -0.014209069311618805, 0.014663074165582657, -0.024273013696074486, 0.021010760217905045, 0.04521361365914345, -0.020842863246798515, 0.01728879287838936, 0.024467196315526962, 0.030953597277402878, -0.030692696571350098, -0.03399771451950073, -0.01822413131594658, -0.03411977365612984, 0.012591194361448288, -0.030316626653075218, 0.017089102417230606, -0.03964579105377197, -0.022773636505007744, -0.018321551382541656, 0.04313795641064644, 0.021948348730802536, 0.027169611304998398, -0.007050611078739166, -0.04244823381304741, -0.002685725688934326, -0.04839956760406494, 0.03471742942929268, 0.03781670704483986, 0.02000540867447853, -0.013240862637758255], [0.01322556659579277, -0.02923687733709812, -0.005600988864898682, -0.03807166963815689, -0.002388201653957367, -0.022895503789186478, -0.01040733978152275, 0.03721782937645912, 0.00700000673532486, -0.006997417658567429, -0.009175706654787064, -0.017682980746030807, 0.041568171232938766, -0.04833580181002617, 0.027598407119512558, 0.02707875892519951, -0.026698768138885498, -0.026028811931610107, 0.016377177089452744, -0.007975101470947266, -0.026270020753145218, 0.016262900084257126, 0.04455507919192314, -0.013988099992275238, 0.001332901418209076, 0.021786224097013474, -0.02401968277990818, 0.017963837832212448, 0.01716430112719536, 0.04038168117403984, 0.010057687759399414, -0.030537033453583717, 0.026794638484716415, -0.021282637491822243, 0.0024959221482276917, 0.006349325180053711, -0.018598806113004684, 0.04904644563794136, -0.019184518605470657, 0.049301039427518845, -0.014262162148952484, 0.042905036360025406, -0.018026627600193024, -0.019163811579346657, 0.016796711832284927, -0.029453564435243607, 0.02112964168190956, -0.01993718184530735, -0.04412050172686577, -0.0038846246898174286, 0.0005076415836811066, 0.014691796153783798, -0.045254647731781006, 0.011494457721710205, 0.016555678099393845, 0.01656755432486534, -0.03641289472579956, 0.009480893611907959, 0.0005368106067180634, 0.003857530653476715, 0.03403053060173988, 0.027911458164453506, -0.011396944522857666, 0.027920294553041458, -0.013996340334415436, 0.0071694254875183105, 0.00806506723165512, -0.04035329818725586, 0.041759099811315536, -0.007088027894496918, 0.018077198415994644, 0.023105774074792862, 0.005102239549160004, -0.01865791156888008, -0.008694112300872803, -0.027773989364504814, -0.009350728243589401, 0.03571850433945656, 0.037774551659822464, 0.04152437672019005, 0.030366186052560806, 0.0072372183203697205, -0.021505260840058327, -0.04707542806863785, 0.014476869255304337, 0.04739263281226158, -0.04580148681998253, -0.008457768708467484, 0.020111527293920517, -0.023375511169433594, 0.041790734976530075, -0.02944662608206272, 0.015021171420812607, 0.02035415545105934, -0.04600030183792114, -0.031194567680358887, 0.04914076253771782, -0.04028526693582535, 0.04035678878426552, 0.01716606691479683, -0.014715872704982758, -0.03943493217229843, 0.0073221102356910706, 0.012307882308959961, 0.032896410673856735, -0.019462883472442627, -0.019625235348939896, -0.0022138357162475586, -0.02833564393222332, 0.032804880291223526, 0.030073825269937515, -0.049914468079805374, 0.03048037365078926, -0.012463141232728958, 0.011188149452209473, -0.04458606243133545, -0.046252455562353134, -0.0008591897785663605, -0.02581385336816311, -0.0304113756865263, 0.011303804814815521, -0.001284480094909668, 0.04504740610718727, -0.019958997145295143, -0.03347090631723404, 0.04288459196686745, -0.005972970277070999, -0.04152859374880791], [-0.029425298795104027, -0.027918649837374687, 0.004468370229005814, 0.012439228594303131, -0.045733775943517685, 0.04571725055575371, -0.02202603779733181, 0.03986278548836708, 0.03922858461737633, -0.0249792467802763, 0.026032712310552597, -0.04813182353973389, 0.02018287405371666, 0.0033028945326805115, 0.005125485360622406, -0.026484394446015358, -0.02111755684018135, 0.0018301382660865784, 0.02975182607769966, -0.02449047565460205, -0.009217213839292526, -0.01810174062848091, -0.029945647343993187, 0.032335493713617325, 0.014361407607793808, 0.045708026736974716, -0.008981667459011078, 0.043204162269830704, -0.037668608129024506, 0.021647300571203232, 0.005964349955320358, 0.01441604271531105, 0.03785308822989464, -0.0358097180724144, -0.0044206976890563965, 0.018279682844877243, -0.0181504487991333, 0.03903157636523247, -0.03798551484942436, -0.026269733905792236, -0.013521932065486908, 0.03141352906823158, -0.04454168304800987, -0.017634976655244827, 0.026630941778421402, 0.010897982865571976, -0.0071434155106544495, 0.03915131464600563, -0.030360771343111992, -0.013253070414066315, 0.0018176920711994171, -0.048289407044649124, -0.008948825299739838, 0.01231294870376587, 0.01762031391263008, 0.03383458033204079, -0.016956329345703125, -0.009075187146663666, 0.006313156336545944, 0.04353158548474312, -0.006444275379180908, 0.03876082971692085, 0.01774359866976738, 0.036804068833589554, 0.04042888805270195, 0.042504023760557175, 0.01778237894177437, 0.0258488692343235, 0.018473457545042038, -0.00581582635641098, -0.02065650187432766, 0.019396577030420303, 0.030929435044527054, 0.018590275198221207, -0.023043155670166016, -0.012326478958129883, 0.016862239688634872, -0.03981836885213852, 0.007376503199338913, 0.029530826956033707, 0.013212669640779495, -0.014122344553470612, 0.030723895877599716, -0.03186695650219917, -0.0102744922041893, -0.019329000264406204, 0.00022802501916885376, 0.03371560946106911, -0.029798686504364014, -0.003544151782989502, 0.01399601623415947, -0.03654830530285835, 0.03000757470726967, 0.023312699049711227, -0.013110507279634476, 0.04772016033530235, -0.008810888975858688, 0.01295696571469307, -0.022465145215392113, -0.0400385856628418, 0.022918883711099625, 0.024235811084508896, -0.010118626058101654, 0.027518998831510544, 0.01863354817032814, 0.04928961023688316, -0.031194377690553665, -0.0005967244505882263, 0.017750333994627, 0.009385038167238235, -0.01869208738207817, -0.04326772689819336, 0.021107923239469528, 0.0033688433468341827, -0.04313468933105469, -0.03316477686166763, -0.02454848401248455, -0.026051878929138184, 0.025371301919221878, -0.04030816629528999, -0.0319875031709671, -0.020099414512515068, -0.0029553063213825226, -0.008424483239650726, 0.008102796971797943, -0.01923530176281929, -0.00871967151761055, -0.03627784177660942], [0.019745592027902603, 0.01819637045264244, -0.04682708904147148, 0.0133059062063694, -0.048342347145080566, 0.04492125287652016, 0.01789841428399086, 0.04580124840140343, -0.017707478255033493, 0.032880451530218124, -0.02544269524514675, 0.03278665617108345, 0.04692082479596138, 0.015356626361608505, -0.01288294792175293, -0.015217103064060211, -0.007861137390136719, -0.029374970123171806, -0.017423342913389206, -0.04003481939435005, -0.04674416780471802, -0.049136579036712646, -0.03819962590932846, -0.03261575847864151, -0.019658101722598076, 0.018255483359098434, 0.028635729104280472, 0.005132604390382767, -0.019550180062651634, 0.009260047227144241, -0.014894664287567139, -0.046310342848300934, -0.02736070193350315, 0.010303985327482224, -0.037689078599214554, 0.019545864313840866, -0.021915340796113014, -0.009993650019168854, -0.03692420572042465, -0.01571723073720932, -0.027095748111605644, 0.02445903792977333, -0.021642744541168213, -0.013195991516113281, -0.012927614152431488, 0.04812436178326607, -0.02323021925985813, 0.020627785474061966, -0.025287866592407227, -0.012689687311649323, 0.02884206548333168, 0.031040433794260025, -0.040067948400974274, 0.038980040699243546, 0.013377595692873001, -0.032028332352638245, 0.02858717367053032, 0.006679702550172806, 0.031876493245363235, -0.006099630147218704, -0.041397880762815475, 0.031195510178804398, 0.030692707747220993, -0.03217635303735733, 0.042399320751428604, 0.046017955988645554, -0.006516873836517334, -0.049469854682683945, 0.04138871654868126, 0.04119756445288658, 0.0003320947289466858, -0.029958665370941162, -0.04382195696234703, -0.03594764322042465, 0.04432213678956032, 0.020997975021600723, -0.04601769521832466, 0.04475431516766548, 0.0003688819706439972, 0.0385647676885128, -0.025027692317962646, -0.006634093821048737, 0.01649627462029457, -0.025746583938598633, 0.022908877581357956, -0.039771389216184616, 0.040162596851587296, -0.0009502284228801727, -0.010590888559818268, -0.04308723285794258, 0.01632082834839821, -0.022635770961642265, 0.0037584081292152405, -0.04869810491800308, -0.02599203586578369, 0.00839986652135849, 0.015758778899908066, -0.005665648728609085, -0.0449652336537838, -0.0487859845161438, -0.023266589269042015, 0.014709938317537308, 0.047044072300195694, -0.031446292996406555, -0.011394929140806198, -0.021587802097201347, -0.00026104599237442017, 0.006954990327358246, -0.029657864943146706, -0.0197508092969656, -0.03933147341012955, -0.004663337022066116, 0.04277820512652397, -0.006524465978145599, 0.011768616735935211, 0.012218393385410309, 0.008344948291778564, -0.022030938416719437, 0.03019953891634941, 0.005435049533843994, 0.013368938118219376, -0.04535797983407974, 0.01563999429345131, -0.037586938589811325, 0.03516331687569618, -0.007367301732301712, -0.03586972877383232, 0.03896946832537651], [-0.010509751737117767, -0.03239443153142929, -0.025488460436463356, -0.021575475111603737, 0.04552513733506203, -0.0020146481692790985, 0.044943857938051224, 0.04313764348626137, 0.03585526719689369, 0.025452446192502975, -0.015178371220827103, 0.004615090787410736, -0.04081933572888374, -0.035646259784698486, -0.044764962047338486, 0.012462176382541656, -0.045549821108579636, 0.013184253126382828, 0.0020853057503700256, 0.02937767282128334, 0.015814069658517838, 0.039820995181798935, 0.025666985660791397, -0.029456758871674538, 0.0026168711483478546, -0.04874217510223389, 0.03531421348452568, 0.024611737579107285, -0.022105623036623, 0.013867486268281937, -0.007662631571292877, 0.0169830359518528, 0.019932832568883896, 0.024039771407842636, -0.006887935101985931, -0.039245106279850006, -0.026575541123747826, -0.008593093603849411, 0.009520173072814941, 0.03532456234097481, -0.02942202053964138, -0.030088795349001884, -0.0075754523277282715, 0.02474517747759819, -0.007457256317138672, 0.02629554644227028, 0.04317248985171318, 0.04886818304657936, -0.024158883839845657, 0.022274982184171677, 0.016805682331323624, -0.030721748247742653, -0.02150496281683445, 0.0315268374979496, 0.007175672799348831, -0.040470074862241745, 0.005803514271974564, 0.003406323492527008, 0.04530683532357216, 0.024880003184080124, -0.02901330031454563, 0.023244332522153854, -0.0315125472843647, 0.010580159723758698, 0.023781191557645798, 0.021858159452676773, 0.03706247732043266, 0.03436074033379555, -0.04282170534133911, -0.034850455820560455, 0.018237020820379257, 0.022885803133249283, 0.01505371555685997, -0.04517316818237305, -0.01573476940393448, 0.025025974959135056, 0.033114347606897354, 0.0011962279677391052, 0.005328953266143799, 0.029102567583322525, 0.04100705310702324, 0.01171799749135971, -0.02382572926580906, 0.011465918272733688, 0.033380452543497086, 0.04697226360440254, -0.012949027121067047, -0.03702247142791748, 0.02731591835618019, 0.008709274232387543, 0.02066056802868843, -0.028095364570617676, -0.01987668313086033, -0.00011205673217773438, 0.01737380400300026, 0.037917327135801315, 0.04058084264397621, -0.032556235790252686, 0.01666046306490898, -0.021338773891329765, 0.03668905422091484, -0.046944357454776764, 0.02339719608426094, -0.025853371247649193, 0.03017774596810341, -0.031197572126984596, -0.02921478822827339, 0.020880427211523056, -0.03694678470492363, -0.02273118495941162, -0.030133187770843506, -0.042746808379888535, -0.034333303570747375, 0.04330270364880562, 0.03752286359667778, -0.027606917545199394, -0.021520018577575684, 0.0269399993121624, 0.010085426270961761, -0.02160782925784588, 0.048401620239019394, 0.04765402153134346, -0.03364213556051254, 0.038032177835702896, 0.026228871196508408, 0.04589681699872017, -0.03727363422513008, 0.010489366948604584], [0.00669701024889946, -0.029053032398223877, -0.008033670485019684, 0.04854464903473854, -0.04236268997192383, 0.02125612273812294, -0.021649885922670364, -0.04520174488425255, -0.04268689081072807, 0.027737710624933243, 0.011975158005952835, -0.04314826801419258, 0.00012946128845214844, 0.03349337354302406, -0.02199242077767849, -0.010133862495422363, 0.014028538018465042, -0.0011778101325035095, 0.03785249963402748, 0.029823731631040573, 0.04572323337197304, -0.019253361970186234, 0.027254868298768997, 0.036781344562768936, 0.003557763993740082, -0.03990830108523369, 0.006381083279848099, -0.02494988404214382, 0.04986322298645973, 0.03117949143052101, -0.0050806403160095215, -0.04316296800971031, -0.04606741666793823, 0.014720071107149124, 0.006775867193937302, -0.040122102946043015, 0.011251889169216156, -0.02825998142361641, -0.022984087467193604, 0.0009904876351356506, -0.016068149358034134, -0.02621835470199585, -0.007155276834964752, 0.009432744234800339, 0.02683316543698311, -0.002311311662197113, -0.017586149275302887, -0.03463704511523247, 0.012428104877471924, 0.01995633915066719, 0.022883523255586624, -0.025248348712921143, -0.009434293955564499, 0.018941465765237808, -0.008936583995819092, -0.01888040266931057, 0.02927562966942787, 0.017564665526151657, 0.01667569950222969, -0.025554431602358818, -0.002474546432495117, 0.0063474178314208984, 0.048652853816747665, 0.025642897933721542, 0.04414712265133858, 0.0004201754927635193, 0.006741724908351898, -0.028911804780364037, 0.019132647663354874, -0.011630676686763763, -0.020850932225584984, -0.04641073942184448, 0.00013375282287597656, 0.04635745659470558, -0.0098450668156147, 0.04024815931916237, 0.007747780531644821, -0.008662808686494827, -0.01535496860742569, -0.012795902788639069, -0.012623213231563568, 0.019870135933160782, 0.00434725359082222, 0.04598129913210869, 0.039523039013147354, -0.03203302621841431, 0.0352388359606266, 0.034079696983098984, -0.03167903423309326, 0.04458988085389137, -0.002412736415863037, 0.03797585889697075, 0.043919119983911514, -0.016887642443180084, 0.029009606689214706, -0.0362095832824707, -0.01714766025543213, -0.010216593742370605, -0.024632716551423073, -0.019828641787171364, -0.04122646898031235, -0.0011295303702354431, -0.02544689178466797, 0.014867249876260757, 0.045694854110479355, 0.04767788574099541, 0.007894136011600494, 0.0015352852642536163, 0.03712037578225136, -0.0307382233440876, -0.003066219389438629, -0.02048335038125515, 0.012731458991765976, 0.0018227212131023407, -0.012307833880186081, 0.039269398897886276, -0.0001214742660522461, -0.0067184194922447205, -0.02137601375579834, 0.035880353301763535, 0.023020002990961075, -0.013504337519407272, -0.021641910076141357, -0.033144593238830566, -0.005501877516508102, 0.012533847242593765, 0.02066420391201973, 0.03330228105187416], [0.02709578350186348, 0.005443178117275238, 0.030143488198518753, 0.010274708271026611, 0.03200093284249306, -0.03944354131817818, -0.008061908185482025, -0.0028565898537635803, -0.03631552308797836, 0.013990018516778946, 0.0019051432609558105, -0.002631712704896927, 0.013819966465234756, 0.034685637801885605, 0.04159295931458473, -0.03199007362127304, 0.03230966255068779, -0.026149321347475052, 0.0007007941603660583, -0.03218747675418854, 0.01870368793606758, 0.020958218723535538, 0.04493189975619316, -0.0401494987308979, 0.004253257066011429, 0.016538772732019424, -0.012711334973573685, 0.02423122152686119, -0.005082488059997559, 0.03480101749300957, 0.01704045757651329, -0.0021704062819480896, -0.009781479835510254, -0.009377360343933105, -0.04776529222726822, -0.049540914595127106, 0.010732900351285934, 0.013053897768259048, 0.0017195232212543488, 0.017972957342863083, 0.019728492945432663, 0.0056715235114097595, -0.006047725677490234, 0.008934937417507172, 0.037630822509527206, -0.031216872856020927, 0.02313859388232231, 0.018611107021570206, -0.015499282628297806, -0.048361074179410934, -0.025292253121733665, -0.004172109067440033, -0.0030355453491210938, -0.013340987265110016, 0.024401817470788956, -0.04461098834872246, 0.005105387419462204, -0.025656534358859062, -0.04059581831097603, 0.013003472238779068, -0.036854445934295654, -0.010303735733032227, -0.023604227229952812, 0.04295862838625908, -0.04815654829144478, 0.03212443366646767, -0.031635358929634094, 0.024661768227815628, 0.019018162041902542, -0.0457015298306942, 0.00819016620516777, 0.0020938143134117126, 0.04845592752099037, -0.01722632721066475, -0.01806863397359848, 0.04208538308739662, -0.013793252408504486, -0.010058797895908356, 0.0092422254383564, -0.03193523734807968, 0.020290646702051163, 0.008655272424221039, 0.04442406818270683, 0.018581096082925797, -0.03875470161437988, -0.028484750539064407, 0.009765446186065674, -0.03312790393829346, -0.003505658358335495, 0.04034588113427162, 0.024418745189905167, -0.047259628772735596, 0.010293770581483841, -0.047212447971105576, -0.005007971078157425, 0.02438047155737877, -0.009246230125427246, 0.0028378255665302277, 0.030227962881326675, -0.011401854455471039, -0.03904249519109726, -0.03570248931646347, 0.016136381775140762, 0.04817274585366249, -0.03472942113876343, -0.01765383407473564, -0.01411522552371025, 0.019253823906183243, 0.0069778673350811005, 0.04277818277478218, 0.0022036805748939514, 0.011934567242860794, 0.02054956927895546, -0.045001961290836334, -0.03339018672704697, -0.010107744485139847, 0.02592814341187477, -0.0238947756588459, -0.024372374638915062, 0.017615798860788345, 0.00942777469754219, -0.025302588939666748, -0.008575867861509323, 0.0183604396879673, 0.016992557793855667, 0.004079975187778473, 0.030970003455877304, -0.01710616424679756], [0.004380248486995697, 0.03696126863360405, -0.020596861839294434, 0.023098673671483994, 0.015611458569765091, -0.03809928894042969, -0.03606114536523819, 0.026138629764318466, 0.01242140680551529, -0.02034219540655613, 0.036818455904722214, 0.0132807157933712, -0.03756629303097725, -0.0271544698625803, -0.02972397767007351, -0.008924007415771484, 0.007477927953004837, -0.04013246297836304, -0.040426790714263916, 0.01935439184308052, 0.0386790968477726, -0.0013686902821063995, -0.028142321854829788, 0.027538929134607315, 0.007194828242063522, 0.04308312013745308, 0.03129153326153755, -0.047261323779821396, -0.01600559800863266, 0.048053134232759476, 0.03217453137040138, 0.01998552307486534, -0.02076517418026924, 0.023406092077493668, 0.015240754932165146, -0.013569533824920654, 0.02556593343615532, -0.028250504285097122, -0.018471229821443558, 0.010391604155302048, -0.043984927237033844, 0.006929386407136917, -0.02891528606414795, -0.031707607209682465, 0.009002208709716797, 0.018990371376276016, 0.04259030893445015, -0.004761122167110443, 0.018414977937936783, 0.013366784900426865, -0.037730418145656586, 0.01610046997666359, -0.027298808097839355, 0.015557300299406052, -0.0013118013739585876, 0.026317942887544632, 0.020766746252775192, -0.049875449389219284, -0.015931986272335052, -0.028914345428347588, -0.031678929924964905, -0.008866775780916214, 0.0222540982067585, -0.03815446048974991, -0.0367007851600647, 0.03934306278824806, 0.0348021425306797, -0.03873523324728012, 0.03494229540228844, -0.032944224774837494, 0.04682287946343422, 0.033769022673368454, -0.027375996112823486, -0.011598169803619385, 0.025309357792139053, 0.028427783399820328, 0.022714469581842422, 0.041990045458078384, -0.0032999031245708466, 0.02180168405175209, -0.0071104541420936584, -0.04727649688720703, 0.00823359563946724, -0.01289297267794609, 0.026073846966028214, 0.026112917810678482, -0.03947361558675766, -0.029265666380524635, 0.03323883190751076, 0.012080181390047073, -0.012682236731052399, 0.04292270913720131, -0.03175128996372223, -0.028563786298036575, 0.03955428674817085, -0.0015874989330768585, 0.02071453258395195, -0.03369265794754028, -0.003043282777070999, 0.04681536927819252, -0.020969225093722343, 0.04350949451327324, 0.024657558649778366, 0.013290468603372574, 0.00455470010638237, -0.010534428060054779, 0.035085055977106094, -0.042867518961429596, 0.020113196223974228, 0.02369842305779457, 0.049545515328645706, -0.014627180993556976, 0.01997489109635353, -0.03180520609021187, -0.002092994749546051, -0.0007623434066772461, 0.044442180544137955, 0.004490029066801071, -0.028897369280457497, -0.016670238226652145, -0.02981189452111721, -0.0017378702759742737, -0.008862841874361038, -0.028334463015198708, 0.029733482748270035, 0.029618609696626663, -0.02542499266564846, -0.0014948025345802307], [0.019871819764375687, -0.017418671399354935, -0.021620405837893486, -0.01446535438299179, 0.04734717682003975, 0.048420216888189316, 0.030026230961084366, -0.030565643683075905, 0.03327405825257301, -0.03887211158871651, -0.008047342300415039, -0.04174598306417465, -0.016866277903318405, -0.034280143678188324, 0.039676252752542496, -0.03318305313587189, -0.0422247052192688, -0.007126711308956146, -0.04943965747952461, 0.01256248727440834, 0.009572051465511322, -0.032475925981998444, -0.00933600589632988, 0.023640226572752, -0.027854586020112038, 0.02263704314827919, 0.03691171482205391, 0.013790581375360489, 0.02418774738907814, -0.009458459913730621, -0.028486669063568115, -0.03713177517056465, 0.011399172246456146, 0.024153564125299454, 0.0114128477871418, 0.016844484955072403, -0.0039247870445251465, -0.031084716320037842, -0.03879593685269356, 0.009473253041505814, -0.009657107293605804, 0.04683258756995201, 0.027090255171060562, 0.03068913146853447, 0.006715048104524612, -0.035776637494564056, 0.004520248621702194, -0.032913900911808014, 0.021710384637117386, 0.02573210373520851, 0.01193462684750557, -0.023768140003085136, 0.0018159858882427216, -0.049971699714660645, 0.0021095983684062958, 0.024546172469854355, 0.007231414318084717, 0.0005646944046020508, 0.04465577378869057, 0.03425062075257301, 0.026925865560770035, 0.043705690652132034, 0.013211380690336227, -0.033581338822841644, -0.04971529170870781, -0.03570472076535225, -0.02896866761147976, -0.005684543401002884, 0.022006284445524216, -0.039659321308135986, -0.018482912331819534, 0.006594955921173096, -0.04671335220336914, 0.022213641554117203, 0.013476084917783737, 0.0056657083332538605, -0.04521739482879639, -0.015938103199005127, -0.04122108221054077, -0.027410173788666725, 0.03393072262406349, 0.0008834227919578552, 0.04212571308016777, 0.013035546988248825, -0.003543030470609665, 0.006165347993373871, -0.04697580263018608, -0.008829571306705475, -0.006634794175624847, -0.019376015290617943, 0.047229234129190445, -0.014067374169826508, -0.025333845987915993, 0.009400475770235062, 0.03317171707749367, -0.040551185607910156, 0.01212768629193306, -0.008044112473726273, 0.01757199689745903, -0.049510326236486435, 0.018164191395044327, 0.013358507305383682, 0.028080832213163376, 0.01470930501818657, 0.012549463659524918, 0.030846964567899704, -0.04036714881658554, 0.0029714107513427734, -0.00592731311917305, -0.010438155382871628, -0.0035565122961997986, -0.041694868355989456, 0.028635870665311813, 0.04307246580719948, 0.049704838544130325, -0.021278584375977516, -0.015358161181211472, 0.04327399656176567, -0.004162490367889404, 0.04229295626282692, -0.03355830907821655, -0.004670359194278717, 0.028820399194955826, -0.040164507925510406, -0.04530829191207886, -0.03233807161450386, 0.0471329428255558, -0.04881005361676216], [-0.007903672754764557, -0.013575218617916107, 0.03249499574303627, -0.042802538722753525, 0.008469212800264359, -0.027726685628294945, -0.00948948785662651, -0.004965674132108688, -0.01648028939962387, 0.04968130961060524, -0.030334342271089554, -0.029093945398926735, 0.02602391317486763, -0.00918661430478096, 0.006698537617921829, 0.03709063306450844, -0.03304906189441681, -0.01656036451458931, 0.002880144864320755, -0.014918304979801178, 0.013123463839292526, 0.031720492988824844, 0.03367144986987114, -0.022013580426573753, -0.0022927895188331604, -0.027219271287322044, 0.015344392508268356, -0.008520353585481644, 0.020750906318426132, -0.02790023200213909, -0.017322838306427002, 0.024434808641672134, -0.04315458610653877, -0.049577631056308746, 0.03277545049786568, -0.011446285992860794, -0.021514272317290306, -0.015075813978910446, -0.047437965869903564, -0.039864182472229004, -0.0039220936596393585, 0.0462995208799839, -0.047992732375860214, -0.040953051298856735, 0.0140526182949543, 0.023743245750665665, -0.04422653838992119, 0.035425473004579544, -0.00912860780954361, 0.009859777987003326, 0.007338009774684906, 0.011369038373231888, 0.01268007978796959, -0.02362746000289917, 0.020094584673643112, 0.01507585123181343, 0.010840009897947311, 0.044999901205301285, -0.006374776363372803, 0.01360095664858818, 0.0053993575274944305, 0.04940737411379814, 0.031129468232393265, 0.029846105724573135, -0.0354209765791893, -0.032412610948085785, -0.044879209250211716, -0.034430764615535736, 0.02758007124066353, -0.0090835802257061, 0.03774019703269005, 0.011814452707767487, 0.005527712404727936, -0.015321590006351471, 0.012988869100809097, 0.014748740941286087, -0.03134434297680855, -0.044795334339141846, -0.021787142381072044, -0.023957742378115654, -0.018298912793397903, 0.008212041109800339, 0.0011108629405498505, 0.04214984551072121, 0.008470475673675537, 0.04025057330727577, -0.031291116029024124, -0.043714918196201324, -0.024766195565462112, 0.03921503946185112, -0.02295975759625435, -0.045849528163671494, -0.007460784167051315, -0.04552407190203667, -0.001982748508453369, 0.012509394437074661, 0.044657837599515915, -0.002791084349155426, 0.0027981996536254883, -0.03650341182947159, -0.03392297029495239, -0.048365868628025055, -0.04543416574597359, 0.021093737334012985, -0.03900517150759697, -0.009457312524318695, 0.029108095914125443, 0.03171434625983238, -0.02894306182861328, -0.03699235990643501, -0.021014321595430374, 0.007040511816740036, -0.014360882341861725, -0.022809911519289017, 0.009259842336177826, 0.04638631269335747, 0.014977719634771347, 0.03165611997246742, -0.010695099830627441, -0.04121585935354233, -0.01842663437128067, 0.011989891529083252, -0.013934828341007233, 0.03706878796219826, -0.03018941916525364, 0.04817641153931618, -0.030029309913516045, -0.03762754052877426], [0.03243919834494591, 0.04178253188729286, -0.03834056854248047, -0.016742348670959473, 0.03378191962838173, -0.024019230157136917, -0.021085215732455254, -0.03034806251525879, 0.0039665475487709045, -0.04151022434234619, 0.019612286239862442, 0.030131254345178604, -0.025826621800661087, 0.015452113002538681, -0.023454368114471436, -0.001146554946899414, 0.008946310728788376, -0.022682977840304375, -0.013261877000331879, -0.0022068992257118225, 0.017588350921869278, -0.02574470080435276, 0.0064221397042274475, 0.034076008945703506, -0.020541787147521973, 6.47418200969696e-05, -0.030558062717318535, -0.018255867063999176, -0.03586232662200928, -0.025184977799654007, -0.029889298602938652, 0.0005640871822834015, 0.03929411247372627, -0.04330454021692276, 0.018849443644285202, -0.02825535647571087, -0.042085111141204834, -0.036420322954654694, -0.004834450781345367, -0.003156505525112152, -0.03705018758773804, 0.022461500018835068, 0.01702585443854332, 0.02263249084353447, 0.018514659255743027, 0.0002646222710609436, -0.012683093547821045, 0.02266145870089531, 0.0005529634654521942, -0.014143586158752441, -0.04275064542889595, -0.0009417161345481873, -0.04482853412628174, 0.024226102977991104, -0.014345835894346237, -0.03245101124048233, -0.003998696804046631, 0.03815655782818794, -0.006908096373081207, -0.0443301685154438, -0.04077401012182236, 0.0190700925886631, -0.01578061655163765, 0.006690703332424164, -0.02387758530676365, 0.00215747207403183, 0.01740923896431923, 0.02965051308274269, 0.04896276071667671, -5.363300442695618e-05, 0.011987090110778809, -0.042597461491823196, 0.03270978108048439, 0.030986037105321884, 0.022266637533903122, -0.004151143133640289, 0.021876584738492966, -0.020419275388121605, -0.04972391203045845, -0.030472254380583763, 0.0217914842069149, -0.04833867773413658, 0.047531697899103165, 0.04622464254498482, 0.048090074211359024, -0.026287628337740898, -0.032318174839019775, 0.0458093024790287, -0.03223148733377457, 0.022227320820093155, -0.013599000871181488, 0.0005553476512432098, 0.028920259326696396, 0.026918362826108932, 0.003737282007932663, -0.025660907849669456, -0.019030440598726273, 0.020251203328371048, -0.012828100472688675, -0.03297475725412369, 0.02507742866873741, 0.01181330531835556, 0.04040971025824547, 0.03562657907605171, -0.03335299342870712, -0.016952883452177048, 0.004111040383577347, 0.009207464754581451, -0.016166605055332184, -0.045332636684179306, -0.02774052694439888, -0.02293846569955349, -0.014686178416013718, -0.03500998020172119, 0.0005509480834007263, -0.021914733573794365, -0.01172792911529541, -0.0069599635899066925, -0.04451736435294151, 0.029206540435552597, -0.0026089660823345184, 0.002619672566652298, 0.026694010943174362, 0.024596158415079117, -0.04693753644824028, 0.03209177032113075, 0.009822975844144821, 0.007948588579893112], [0.04111304506659508, 0.04663529619574547, -0.02093651331961155, 0.008156072348356247, 0.036939751356840134, -0.014125622808933258, -0.01373974233865738, 0.016671810299158096, 0.018311847001314163, 0.038797590881586075, 0.048579368740320206, 0.03087768331170082, 0.0011785849928855896, 0.01315021887421608, -0.03363090753555298, 0.004140399396419525, 0.004485618323087692, 0.0005851015448570251, 0.020523373037576675, -0.014927946031093597, -0.002146124839782715, 0.02388313040137291, 0.04474221542477608, 0.03673729673027992, 0.030366215854883194, -0.013355899602174759, -0.028016043826937675, -0.012332938611507416, 0.01867106184363365, -0.021514201536774635, -0.04621154069900513, 0.015031371265649796, -0.02353033982217312, -0.01757122203707695, -0.041750501841306686, 0.0009756311774253845, 0.010265707969665527, 0.008571363985538483, 0.022660579532384872, 0.03865710273385048, -0.02457348071038723, 0.0314788855612278, -0.001989603042602539, -0.020763397216796875, 0.0193374864757061, 0.012446761131286621, 0.03265266492962837, 0.015910889953374863, 0.007303275167942047, -0.029535293579101562, -0.014130163937807083, 0.04598340019583702, -0.04490702226758003, 0.019735682755708694, 0.0402858592569828, -0.024635959416627884, -0.04205198213458061, -0.0391695611178875, 0.040079716593027115, 0.017166387289762497, -0.03195232152938843, -0.008719027042388916, -0.024800121784210205, -0.022233307361602783, -0.03298221901059151, -0.033732760697603226, 0.021167311817407608, 0.010903634130954742, -0.025036228820681572, -0.018741417676210403, -0.014291513711214066, 0.010686744004487991, -0.00026851892471313477, 0.04522528871893883, 0.04687171056866646, -0.006710231304168701, -0.011545561254024506, 0.035715822130441666, 0.007916189730167389, -0.04803292825818062, 0.021312285214662552, 0.041419316083192825, 0.013313818722963333, -0.044269442558288574, -0.027406394481658936, 0.006323505192995071, 0.03573254123330116, 0.03606140986084938, -0.049394357949495316, -0.030686283484101295, -0.02091982401907444, -0.031033802777528763, -0.03814011812210083, -0.023728061467409134, -0.03991143777966499, -0.036325253546237946, 0.011239409446716309, -0.04226665571331978, -0.0232999324798584, 0.024888906627893448, 0.006028272211551666, 0.019095543771982193, -0.020078588277101517, 0.0025747790932655334, -0.0013959184288978577, 0.008146703243255615, -0.009532582014799118, -0.004312776029109955, 0.018325749784708023, 0.028216253966093063, 0.03989270702004433, -0.023014117032289505, -0.04076594114303589, -0.04743964597582817, 0.03922547027468681, 0.04168819263577461, -0.010683774948120117, 0.03164222463965416, 0.036615025252103806, 0.016288165003061295, -0.011332333087921143, -0.006440889090299606, 0.0422147773206234, 0.03568318858742714, -0.0139121413230896, 0.03167254105210304, 0.031354714184999466, -0.010793138295412064], [0.015239406377077103, 0.024217639118433, -0.025914860889315605, 0.02678995206952095, 0.007165264338254929, -0.014985181391239166, 0.04202022776007652, 0.04140034690499306, 0.03745699301362038, 0.008613646030426025, -0.0447186715900898, 0.036240193992853165, -0.04088715463876724, 0.020813647657632828, 0.04073560610413551, -0.00815897062420845, -0.03110142983496189, -0.03737287595868111, 0.011680863797664642, -0.033094845712184906, -0.016782663762569427, 0.04910377040505409, -0.03393050283193588, -0.035777509212493896, 0.028033506125211716, 0.042473260313272476, -0.04635453224182129, 0.033397603780031204, 0.04399074241518974, -0.04306204244494438, 0.012759778648614883, 0.021805141121149063, -0.02695918083190918, 0.04336675629019737, -0.010053060948848724, -0.012141980230808258, 0.04949474707245827, -0.048573076725006104, 0.0032112225890159607, -0.020531201735138893, 0.001367427408695221, -0.020358312875032425, 0.03607100620865822, -0.04773590713739395, 0.01577000692486763, -0.012243915349245071, 0.019519280642271042, 0.02484581246972084, -0.015173327177762985, 0.01836996152997017, 0.04312935099005699, 0.02172126993536949, 0.042022351175546646, 0.022687938064336777, 0.01365676149725914, -0.027042245492339134, 0.035513985902071, 0.011218439787626266, -0.023310387507081032, 0.04754222556948662, 0.020264867693185806, 0.005254853516817093, 0.018737558275461197, 9.514391422271729e-06, -0.0031916722655296326, 0.02037186548113823, 0.032866884022951126, 0.024392787367105484, -0.0051365382969379425, 0.01675475761294365, -0.04107379913330078, 0.001429188996553421, 0.013173948973417282, -0.04288243129849434, 0.03522953763604164, 0.02295709028840065, 0.023443114012479782, 0.008187495172023773, 0.015533450990915298, -0.0434742234647274, -0.04627756029367447, -0.0450955405831337, 0.035133589059114456, -0.04435382038354874, 0.005469240248203278, 0.007852278649806976, -0.0188131220638752, 0.04481637850403786, -0.039301346987485886, -0.003052331507205963, -0.049250926822423935, 0.04542018100619316, 0.016400877386331558, -0.02497093752026558, 0.013931740075349808, 0.031793247908353806, 0.03206726536154747, -0.045997392386198044, 0.04608049616217613, 0.04741274192929268, -0.01947394572198391, -0.01006985828280449, -0.022829031571745872, -0.04361093044281006, -0.04342156648635864, 0.038091909140348434, -0.033728647977113724, 0.02557874098420143, -0.0029574744403362274, -0.04967096075415611, 0.003953613340854645, -0.00229557603597641, -0.0460500493645668, 0.04747506603598595, -0.014766395092010498, 0.02201252058148384, -0.009597886353731155, 0.04620513692498207, 0.017126452177762985, -0.03930247947573662, -0.020359886810183525, -0.01567918062210083, 0.022839214652776718, 0.005429171025753021, -0.04763846471905708, -0.027361547574400902, -0.010803021490573883, 0.0034964196383953094], [0.020141098648309708, 0.027536939829587936, -0.035380519926548004, -0.019222939386963844, -0.045383013784885406, 0.023666594177484512, -0.03676255792379379, 0.04731551185250282, 0.011349260807037354, -0.0015107020735740662, 0.013543616980314255, -0.03652489185333252, -0.0027602091431617737, -0.0416155569255352, -0.004194937646389008, -0.034431636333465576, 0.0020189769566059113, -0.036958180367946625, -0.04582393169403076, -0.04844215139746666, 0.027353916317224503, -0.03127805143594742, 0.04890457168221474, -0.038929473608732224, 0.040480468422174454, -0.03151490539312363, -0.01040877029299736, 0.0076118335127830505, -0.0020239464938640594, 0.04514247551560402, 0.009848345071077347, -0.04524713754653931, 0.04620121791958809, -0.02425987832248211, -0.009636927396059036, -0.04359946399927139, -0.03881790488958359, -0.028514552861452103, 0.04767357185482979, 0.011646877974271774, 0.021442759782075882, -0.00800180435180664, 0.04674440994858742, -0.014025617390871048, -0.02775670401751995, -0.04316125065088272, 0.01907605305314064, 0.04677252843976021, 0.039451394230127335, -0.04520208761096001, -0.001714516431093216, -0.03439443185925484, -0.004116225987672806, -0.04182959720492363, -0.0396907702088356, -0.04391295835375786, 0.019954774528741837, 0.03828174248337746, 0.025433506816625595, 0.04182802513241768, 0.04171336814761162, 0.026489023119211197, -0.03768075630068779, -0.025226032361388206, 0.04239675775170326, 0.049318719655275345, -0.047826137393713, 0.04270477220416069, 0.00826319307088852, -0.01851750537753105, 0.03914782777428627, -0.022457683458924294, 0.04204234108328819, -0.02522076480090618, 0.036348115652799606, -0.019990265369415283, -0.020073210820555687, 0.008243560791015625, 0.034789178520441055, 0.047981392592191696, 0.004391573369503021, 0.010487210005521774, -0.021318459883332253, -0.03942995145916939, 0.0036527998745441437, 0.04762761667370796, -0.012846458703279495, -0.004065297544002533, 0.026845920830965042, -0.03242114931344986, -0.03132231533527374, 0.0019717812538146973, -0.028964364901185036, -0.014905024319887161, 0.001881968230009079, 0.03226076439023018, -0.03560403734445572, 0.007254861295223236, -0.030295217409729958, -0.03808043152093887, -0.04157615825533867, -0.020299864932894707, 0.030572783201932907, 0.021264616400003433, -0.0033481717109680176, 0.0008942484855651855, -0.0050604455173015594, -0.027941012755036354, -0.0025329962372779846, 0.04007628932595253, 0.03881707414984703, -0.03873429447412491, -0.013953637331724167, -0.010985065251588821, -0.03909566253423691, -0.024210250005126, -0.008308030664920807, 0.042343202978372574, -0.011369504034519196, -0.04042360931634903, 0.04574995115399361, 0.01747668907046318, 0.033700767904520035, -0.038421712815761566, -0.007909871637821198, -0.04315749555826187, -0.04699522256851196, -0.04100912809371948], [0.03762877359986305, 0.004516672343015671, 0.04934612289071083, 0.033470261842012405, -0.025551605969667435, -0.04091619327664375, -0.03911174461245537, -0.04872288927435875, 0.024319898337125778, 0.019242558628320694, -0.0052891746163368225, -0.04549763351678848, -0.011136006563901901, -0.03061124123632908, 0.026255730539560318, 0.021299291402101517, 0.04600442573428154, -0.01062702015042305, -0.004685640335083008, 0.03600345924496651, 0.01426709070801735, -0.017175815999507904, -0.022744381800293922, -0.026455868035554886, -0.02143695391714573, 0.04551548883318901, 0.0477682389318943, -0.00159454345703125, -0.03604062646627426, -0.029930317774415016, -0.04820447042584419, -0.015904773026704788, 0.029553499072790146, -0.00011665746569633484, 0.015845943242311478, -0.013209141790866852, -0.03713374212384224, -0.04738004133105278, -0.036956094205379486, 0.0495007149875164, 0.01766395941376686, 0.004812203347682953, -0.03368983417749405, 0.04254719987511635, -0.032686710357666016, 0.010705064982175827, -0.04394053295254707, 0.0011388063430786133, 0.03700263425707817, 0.02769651636481285, -0.032253481447696686, 0.03485901281237602, 0.0032205209136009216, 0.018322531133890152, 0.030354585498571396, -0.023692429065704346, 0.0302509106695652, -0.007203113287687302, 0.007351350039243698, -0.017700839787721634, 0.01652076467871666, -0.03019273281097412, 0.006217408925294876, -0.04195815324783325, 0.04230053350329399, -0.015632987022399902, -0.01434386894106865, 0.016535524278879166, 0.03836006298661232, 0.04909254238009453, -0.04612180218100548, 0.019730720669031143, 0.0110853910446167, -0.015293825417757034, 0.04190680757164955, -0.004243694245815277, 0.005340121686458588, -0.04552649334073067, 0.022384632378816605, -0.010040592402219772, -0.01613311842083931, 0.03682612255215645, -0.04228777810931206, 0.029074858874082565, -0.026174426078796387, 0.03723926469683647, 0.009882114827632904, -0.04078040271997452, -0.03338439762592316, 0.005829654633998871, -0.028414512053132057, -0.00983583927154541, -0.01654452085494995, 0.01665421947836876, -0.025640547275543213, -0.0066763050854206085, -0.00611654669046402, 0.043920669704675674, -0.04088813066482544, 0.02122669294476509, -0.0054163336753845215, 0.013936508446931839, 0.04335120692849159, 0.020794298499822617, -0.03202648460865021, -0.014721404761075974, 0.040945831686258316, -0.009586215019226074, 0.016103174537420273, 0.0011288300156593323, 0.027671340852975845, 0.03866959735751152, -0.03841037675738335, 0.005887497216463089, -0.00574488565325737, 0.02402445301413536, 0.02451596036553383, 0.016258183866739273, -0.020836520940065384, -0.029525697231292725, -0.03140391409397125, -0.009705115109682083, -0.002226032316684723, 0.015900742262601852, -0.007619153708219528, -0.046697940677404404, 0.015153352171182632, 0.013894621282815933], [-0.04461611434817314, -0.02406945265829563, 0.0339074470102787, -0.007893253117799759, -0.021137213334441185, -0.012538779526948929, 0.003773234784603119, -0.036149539053440094, -0.03386960178613663, -0.017011046409606934, -0.018382202833890915, -0.042584192007780075, -0.006048750132322311, 0.001216839998960495, -0.005096852779388428, 0.0305156372487545, 0.049724940210580826, -0.019322752952575684, -0.012401103973388672, 0.04534435644745827, 0.025143984705209732, -0.019468581303954124, -0.04304741695523262, 0.015038732439279556, -0.03547384589910507, -0.020331526175141335, 0.04130513593554497, 0.03081667795777321, 0.03187911584973335, -0.02409961260855198, 0.0035440102219581604, -0.025384677574038506, 0.01305859163403511, 0.0373060442507267, -0.0002148151397705078, -0.035433851182460785, -0.04432095214724541, -0.013308010995388031, -0.014033149927854538, -0.0028651952743530273, 0.04302532598376274, -0.01015714555978775, -0.013508297502994537, 0.005447305738925934, 0.0358358733355999, -0.0253366120159626, -0.010216545313596725, 0.0446334145963192, -0.019801080226898193, 0.030570197850465775, -0.004864692687988281, 0.010944150388240814, 0.028785455971956253, 0.004582952708005905, -0.04968857765197754, -0.024675918743014336, -0.03272368758916855, -0.004269041121006012, 0.02106964960694313, -0.009023748338222504, -0.01390613242983818, 0.03492758050560951, 0.04994697496294975, 0.006178032606840134, -0.002952050417661667, -0.008093394339084625, -0.001371227204799652, -0.009432710707187653, -0.022195041179656982, -0.039769064635038376, 0.021635878831148148, -0.03688039630651474, 0.012854788452386856, -0.019924843683838844, -0.011323224753141403, 0.0348941795527935, -0.001847587525844574, -0.047203995287418365, 0.00441056489944458, 0.02176428958773613, -0.001058768481016159, 0.01041189581155777, -0.03280766308307648, -0.03679647296667099, -0.022214019671082497, -0.04267319664359093, -0.001134432852268219, -0.006708014756441116, 0.03405853733420372, 0.028832558542490005, -0.037412129342556, 0.02292652055621147, -0.016644679009914398, 0.035061921924352646, 0.047514524310827255, 0.040771257132291794, -0.03703044727444649, -0.015822313725948334, -0.004137467592954636, -0.01837644726037979, 0.01396164670586586, 0.03221112862229347, 0.013792876154184341, 0.024339709430933, -0.027668297290802002, -0.03540259599685669, -0.02558189630508423, -0.008243072777986526, 0.03208686038851738, 0.022512782365083694, -0.018086254596710205, 0.03951675817370415, -0.010891448706388474, -0.0018578767776489258, -0.03858499601483345, 0.008601021021604538, -0.04835032299160957, 0.014867592602968216, -0.02405991591513157, -0.026845360174775124, -0.0013737305998802185, 0.04490621015429497, 0.0002087131142616272, -0.02199190855026245, -0.008800067007541656, 0.046553824096918106, -0.004259668290615082, -0.0347500815987587], [-0.005299877375364304, 0.03955757990479469, -0.04590426757931709, -0.010384608060121536, -0.04211423546075821, 0.026356566697359085, -0.0168580524623394, 0.024202171713113785, 0.013063039630651474, 0.04340660944581032, -0.02079780213534832, 0.03843926265835762, 0.024002376943826675, 0.019401613622903824, 0.0052307844161987305, 